name: "tensorrt_llm"
backend: "tensorrtllm"
max_batch_size: 4

model_transaction_policy {
  decoupled: True
}

input [
  {
    name: "input_ids"
    data_type: TYPE_INT32
    dims: [-1]
    allow_ragged_batch: true
  },
  {
    name: "input_lengths"
    data_type: TYPE_INT32
    dims: [1]
    reshape: { shape: [] }
  },
  {
    name: "request_output_len"
    data_type: TYPE_INT32
    dims: [1]
    reshape: { shape: [] }
  },
  {
    name: "end_id"
    data_type: TYPE_INT32
    dims: [1]
    reshape: { shape: [] }
    optional: true
  },
  {
    name: "pad_id"
    data_type: TYPE_INT32
    dims: [1]
    reshape: { shape: [] }
    optional: true
  },
  {
    name: "temperature"
    data_type: TYPE_FP32
    dims: [1]
    reshape: { shape: [] }
    optional: true
  },
  {
    name: "runtime_top_k"
    data_type: TYPE_INT32
    dims: [1]
    reshape: { shape: [] }
    optional: true
  },
  {
    name: "runtime_top_p"
    data_type: TYPE_FP32
    dims: [1]
    reshape: { shape: [] }
    optional: true
  },
  {
    name: "streaming"
    data_type: TYPE_BOOL
    dims: [1]
    reshape: { shape: [] }
    optional: true
  },
  {
    name: "stop"
    data_type: TYPE_BOOL
    dims: [1]
    reshape: { shape: [] }
    optional: true
  }
]
output [
  {
    name: "output_ids"
    data_type: TYPE_INT32
    dims: [-1, -1]
  },
  {
    name: "sequence_length"
    data_type: TYPE_INT32
    dims: [-1]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]

parameters: {
  key: "gpt_model_type"
  value: { string_value: "inflight_fused_batching" }
}
parameters: {
  key: "gpt_model_path"
  value: { string_value: "/models/tts/tensorrt_llm/1/engine" }
}
parameters: {
  key: "max_beam_width"
  value: { string_value: "1" }
}
parameters: {
  key: "batch_scheduler_policy"
  value: { string_value: "guaranteed_no_evict" }
}
parameters: {
  key: "cancellation_check_period_ms"
  value: { string_value: "50" }
}
parameters: {
  key: "kv_cache_free_gpu_mem_fraction"
  value: { string_value: "0.1" }
}
parameters: {
  key: "max_tokens_in_paged_kv_cache"
  value: { string_value: "8192" }
}
parameters: {
  key: "max_num_sequences"
  value: { string_value: "4" }
}
parameters: {
  key: "exclude_input_in_output"
  value: { string_value: "true" }
}
parameters: {
  key: "enable_kv_cache_reuse"
  value: { string_value: "false" }
}
parameters: {
  key: "enable_chunked_context"
  value: { string_value: "false" }
}
parameters: {
  key: "decoding_mode"
  value: { string_value: "top_k_top_p" }
}
parameters: {
  key: "executor_worker_path"
  value: { string_value: "/opt/tritonserver/backends/tensorrtllm/trtllmExecutorWorker" }
}
parameters: {
  key: "tokenizer_dir"
  value: { string_value: "/models/tts/assets/cosyvoice2_llm" }
}
parameters: {
  key: "xgrammar_tokenizer_info_path"
  value: { string_value: "" }
}
parameters: {
  key: "guided_decoding_backend"
  value: { string_value: "" }
}
