{
    "architectures": ["T3ForCausalLM"],
    "auto_map": {
        "AutoConfig": "configuration_t3.T3Config",
        "AutoModelForCausalLM": "modeling_t3.T3ForCausalLM"
    },
    "model_type": "t3",
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 6561,
    "eos_token_id": 6562,
    "head_dim": 64,
    "hidden_act": "silu",
    "hidden_size": 1024,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "max_position_embeddings": 8192,
    "mlp_bias": false,
    "num_attention_heads": 16,
    "num_hidden_layers": 30,
    "num_key_value_heads": 16,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 500000.0,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "use_cache": true,
    "vocab_size": 8194,
    "speech_vocab_size": 6561,
    "text_vocab_size": 704,
    "start_speech_token": 6561,
    "stop_speech_token": 6562,
    "conditioning_size": 34,
    "conditioning_path": "/models/t3_weights/conditioning.pt"
}
