name: "speaker_embedding"
backend: "python"
max_batch_size: 1

input [
  {
    name: "reference_wav"
    data_type: TYPE_FP32
    dims: [-1]
  }
]
output [
  {
    name: "prompt_spk_embedding"
    data_type: TYPE_FP16
    dims: [-1]
  }
]

parameters [
  {
    key: "model_dir"
    value: {string_value: "/cosyvoice_build/CosyVoice2-0.5B"}
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]
