# T3 Turbo - Chatterbox Speech Token Generator
# Uses Triton's native vLLM backend for high-performance inference
#
# This model generates speech tokens from text input.
# Conditioning is pre-computed and baked into the model at load time.

name: "t3"
backend: "vllm"

# vLLM handles batching internally
max_batch_size: 0

# Required for async vLLM operations
model_transaction_policy {
  decoupled: True
}

# Input/output required by vLLM backend
input [
  {
    name: "text_input"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "stream"
    data_type: TYPE_BOOL
    dims: [ 1 ]
    optional: true
  },
  {
    name: "sampling_parameters"
    data_type: TYPE_STRING
    dims: [ 1 ]
    optional: true
  }
]

output [
  {
    name: "text_output"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

# vLLM manages GPU resources internally
instance_group [
  {
    count: 1
    kind: KIND_MODEL
  }
]

# Enable custom metrics reporting
parameters: {
  key: "REPORT_CUSTOM_METRICS"
  value: {
    string_value: "true"
  }
}
